

# TSMC 22nm TG 7T 30P Available Filler Cell:
# DCAP64BWP7T30P140HVT DCAP32BWP7T30P140HVT DCAP16BWP7T30P140HVT DCAP8BWP7T30P140HVT DCAP4BWP7T30P140HVT 
# FILL64BWP7T30P140HVT FILL32BWP7T30P140HVT FILL16BWP7T30P140HVT FILL8BWP7T30P140HVT FILL4BWP7T30P140HVT FILL3BWP7T30P140HVT FILL2BWP7T30P140HVT

set filler_cell [list \
	DCAP64BWP7T30P140	\
	DCAP32BWP7T30P140	\
	DCAP16BWP7T30P140	\
	DCAP8BWP7T30P140		\
	DCAP4BWP7T30P140		\
	FILL3BWP7T30P140		\
	FILL2BWP7T30P140		\
]

addFiller -cell ${filler_cell} -prefix "FILL"

verify_drc -limit 9999 -report ../report/postFiller/verify_drc.rpt
saveDesign ../backup/${TopName}_postFiller.enc

